import re

alias = {
    "https://www.pravda.com.ua": "Українська правда",
    "strana.ua": "Страна.ua",
    "https://www.rbc.ua": "РБК-Україна",
    "https://www.obozrevatel.com": "Obozrevatel",
    "24tv.ua": "24 канал",
    "https://censor.net.ua": "Цензор.НЕТ",
    "tsn.ua": "ТСН",
    "gordonua.com": "Гордон",
    "https://politeka.net/uk": "Politeka",
    "https://www.unian.ua": "УНІАН",
    "znaj.ua": "Znaj.ua",
    "https://www.liga.net": "LIGA.net",
    "112.ua": "112.ua",
    "https://www.segodnya.ua/ua": "Сьогодні",
    "apostrophe.ua": "Апостроф",
    "www.unn.com.ua": "УНН",
    "https://ukranews.com": "Українські новини",
    "https://www.epravda.com.ua": "Економічна правда",
    "espreso.tv": "Еспресо ТВ",
    "www.radiosvoboda.org": "Радіо Свобода",
    "fakty.com.ua": "Факти ICTV",
    "https://ukr.lb.ua": "LB.ua",
    "https://hromadske.ua/": "Громадське",
    "zik.ua": "ZIK",
    "https://dt.ua/": "ZN.UA",
    "focus.ua": "Фокус",
    "https://ua.interfax.com.ua": "Інтерфакс-Україна",
    'https://ua.korrespondent.net/': "Корреспондент.net",
    'glavcom.ua': "Главком", 
    'vgolos.com.ua': "Вголос",
    'nv.ua': "НВ",
    'suspilne.media': "Суспільне",
    'zaxid.net': "Zaxid.net",
    'babel.ua': "Бабель",
    'gazeta.ua': "Gazeta.ua",
    'ukrinform.ua': "Укрінформ",
    'telegraf.com.ua': "Телеграф",
    'bykvu.com': "Букви",
    'vesti.ua': "Вести",
    'kp.ua': "КП в Украине",
    'fakty.ua': "Факти",
    'golos.ua': "ГолосUA",
    'today.ua': 'Today.ua'
    }

strip_patterns = {
#     parts to initially strip in all news 
    '': [
        (r"\*\[25 лютого\]: за юліанським календарем.*", re.S),
        (r"^[\w ]*фото:.*?\n", re.M | re.I),
        (r"Теги:.*", re.S),
        (r"Читайте більше:.*$", re.M),
        (r"Тако?же? читайте.*$", re.M),
        (r"Якщо (ви )?(побачили|виявили|помітили|знайшли)( орфографічну)? помилку.*", re.S|re.I), 
        (r"Если Вы заметили орфографическую ошибку.*", re.S), 
        (r"Если вы нашли ошибку в тексте.*", re.S),
#         (r"(^>.*\n)+", re.M), 
        (r"этот материал доступен на русском", re.I),
        (r"читать ((новость|этот материал) )?на русском", re.I),
        (r"Цей матеріал можна прочитати і російською мовою\n", re.I),
        (r"^Реклама$", re.M),
        (r"(ПУБЛИКАЦИИ|МАТЕРИАЛЫ) ПО ТЕМЕ.*", re.S),
        (r"^Твитнуть$", re.M),
        (r"^[ \*]*Розсилка ?\nВІДПРАВИТИ\n?\n?\n?", re.S|re.M),
        (r"\n\n\nКопіювати код для вставки", re.S), 
        (r"^Цей матеріал також доступний українською$", re.M), 
        (r"^Нажмите на фото для увеличения изображения.*$", re.M),
        (r"https://[a-z\./0-9@:%_\+~#\?&=\-\(\)]+", re.I|re.M),
        (r"фото: instagram.com", re.M),
        (r"фото:? (ua\.)?depositphotos(\.com)?", re.M|re.I),
        (r"© president\.gov\.ua ?$", re.M),
        (r" ?\* ?Поділитися (на|у) (Facebook|Twitter|Telegram|ВКонтакте)$", re.M),
        (r"Share on .*$", re.M), 
        (r" ?\* ?Надіслати листом$", re.M),
        (r"^© ?REUTERS ?$", re.M),
        (r"^[\* ]*Кількість (переглядів|коментарів) \d* ?$", re.M),
        (r"^© фото president\.gov\.ua ?$", re.M),
        (r"Авторские права на изображение: TUT. BY", re.M),
        (r"^Коментувати Роздрукувати$", re.M),
        (r"^(Коментувати|Поділитись|Рекомендую|Підписатися)[\: ]*$", re.M),
        (r"Фото: ?Pixabay", re.I),
        (r"Share to (facebook|twitter|telegram|viber)", re.I),
        (r"Найцікавіші історії та новини дня тепер в Telegram!", re.M),
        (r"Арх(и|і)вно?е фото\n", re.I|re.M),
        (r"фото з відкритих джерел\n", re.I|re.M),
        (r"^З відкритих джерел\n", re.I|re.M),
        (r"фото reuters", re.I|re.M),
        (r"[ \*]*Tweet", re.M),
        (r"^Загрузка[\.]*\n", re.M),
        (r"^Реклама$", re.M),
        (r"^> Подивитися цю публікацію в Instagram", re.M),
        (r"^Підписуйтесь на наші канали.*", re.M),
        (r"^Watch this video on YouTube.*", re.M),
        (r"^[# ]*(Facebook|(Associated Press )|(powered by lun\.ua)|Twitter|Telegram|ВКонтакте|WhatsApp|Viber|Email|Стежити|(Google News)|Підписатись|(Скопіювати посилання))[# ]*$", re.M|re.I)

    ],
    
     # strip patterns by domains 
    
    'apostrophe.ua': [
        (r"### Новини.*?Всі новини", re.S),
        (r"### Головні новини.*?### Новини\n### \d+ \w{4,10}\n", re.S),
        (r'^\d\d:\d\d\n.*\n', re.M),
        (r"Версія для друку.*", re.S),
        (r"\w+ новини тепер в Telegram.*", re.S),
        (r"^Читайте тако?же?.*$", re.M),
        (r"Підписуйтесь на канал.*", re.S),
        (r"^Поделиться$", re.M),
        (r"^1 \/ 1$", re.M),
        (r"Як повідомляв \"Апостроф\".*", re.M),
        (r"Раніше \"?Апостроф\"?.*", re.M)
    ],
    'https://www.rbc.ua': [
        (r"Читайте нас в Google News та підписуйтесь.*", re.S),
        (r"Надіслати новину другу\nКому\:\*\nВаш коментар\nНадіслати(\nДякуємо, Ваше повідомлення відправлено\!  \n  \nOk\n)?", re.M),
        (r"Дякуємо, Ваше повідомлення відправлено\!", re.M),
        (r"^Ok$", re.M)
    ],
    'https://www.unian.ua': [
        (r"Читайте останні новини України та світу.*", re.S),
        (r"^Читайте новини шоу\-бізнесу.*", re.M),
        (r"Якщо ви знайшли помилку.*", re.S),
        (r"^Читайте тако?же?.*$", re.M),
        (r"Підписуйтесь на канал УНІАН.*", re.S),
        (r"^ ?#+ ?Що було раніше[ \:]*\n(^ *\*.*\n)+", re.M),
        (r"^[ #]*Що цьому передувало ?\n.*", re.S|re.M),
        (r"^[ #]*((Новини по темі)|(Вас (також )?можуть зацікавити (інші )?новини)|(Вам (також )?може бути цікаво))[ \:]*\n[ \*]+.*", re.S|re.M),
        (r"^ ?#+ ?Більше новин(.*?)\n[ \*]+.*", re.S|re.M),
        (r"^ ?#+ ?Коронавірус в Україні( та світі)?\: (((важливі|інші|останні) новини)|(що відомо)|(інші новини за темою)).*", re.S|re.M),
        (r"^ ?#+ ?(.*?): новини на тему[ \:]*\n[ \*]+.*", re.S|re.M),
        (r"^ ?#+ ?(.*?): що варто знати(.*?)\n[ \*]+.*", re.S|re.M),
        (r"^[ #]*Інші новини(.*?)\n[ \*]+.*", re.S|re.M)
        
    ],
    'ukrinform.ua': [
        (r"^Як повідомляв Укрінформ.*", re.M)
    ],
    'https://censor.net.ua': [
        (r"^.*?Редактор Цензор\. НЕТ", re.S|re.M),
        (r"Мне нравится.*", re.S),
        (r"^Читайте (также ?)?(на \"?Цензор\. НЕТ\"?)?:.*?$", re.M),
#         (r"^Все про:.*?$", re.M),
        (r"Топ комментарии.*", re.S),
        (r"^Читайте:.*$", re.M),
        (r"\nИсточник:.*", re.S)
    ],
    'www.unn.com.ua': [
        (r"(Що було раніше)|(Варто нагадати).*", re.S),
    ],
    'https://politeka.net/uk': [
        (r"Популярні новини зараз.*?Показати ще", re.S),
        (r"^Як (повідомляла|писала|розповідала) .?Politeka.*", re.M),
        (r"^Як .?Politeka.*", re.M),
        (r"^(Також|Раніше) Politeka.*", re.M),
        (r"^До слова,.*", re.M),
        (r"Також ми повідомляли,.*", re.S),
        (r"^А ще Politeka.*", re.M),
        (r"^Як повідомлялося раніше,.*", re.M),
        (r"^Раніше на Politeka.*", re.M),
        (r"Крім того.? Politeka.*", re.M)
    ],
    'www.radiosvoboda.org': [
        (r"^ДИВІТЬСЯ ТАКОЖ: ?\n#+.*?$", re.M),
        (r"[\# ]*### FACEBOO. КОМЕНТАРІ.*", re.S),
        (r"Отримати Adobe Flash Player.*\* \d+p | \d+(\,?\d+)?MB", re.S),
        (r"[\# ]*Читай нас в Google News.*", re.S),
        (r"Думки, висловлені в рубриці «Точка зору».*", re.S),
        (r"Встановлюйте новий застосунок Радіо.*", re.M)
    ],
    'https://dt.ua/': [
        (r"(\^* #[\w ]+)+", re.M),
        (r"^Раніше повідомлялося.*", re.M)
    ],
    'https://hromadske.ua/': [
        (r"Поділитись.*", re.S),
#         (r"Більше про:.*", re.S),
        (r"^Інформаційна гігієна не менш важлива за особисту.*?$", re.M),
        (r"^[# ]*читайте також *\n.*\n.*\n", re.M), ###???
        (r"^[# ]*читайте також *\n.*$", re.M)
    ],
    'https://www.obozrevatel.com': [
        (r"Тисни! Підписуйся!.*", re.S),
        (r"Ти ще не підписаний на наш Telegram.*", re.S),
        (r"Не набридаємо! Тільки найважливіше.*", re.S),
        (r"Підписуйся на наш Telegram.*", re.S),
        (r"^Читайте:.*?$", re.M | re.I),
        (r"Як (повідомляв|розповідав)( раніше)? OBOZREVATEL.*", re.M),
        (r"Раніше OBOZREVATEL (розповідав|повідомляв).*", re.M)
    ],
    'https://www.segodnya.ua/ua': [
        (r"^Також дивіться.*?$", re.M),
        (r"Підпишись на наш telegram.*", re.S),
        (r"[\# ]*Ще кілька матеріалів по темі:.*", re.S),
        (r"^[\# ]*В тренді\n.*$", re.M),
        (r"^Про що ще говорять в Україні та світі.*", re.M),
        (r"^Раніше ми повідомляли.*", re.M)

    ],
    'focus.ua': [
        (r"^Читайте также.*$", re.M),
        (r"^Будь завжди в курсі подій разом із.*", re.M)
#         (r"Как ранее сообщал Фокус:.*", re.S)
    ],
    '112.ua':[
        (r"^#\w+.*?#\w+.*\n", re.M),
        (r"^Новини за темою:.*?$", re.M),
        (r"^(Як|Раніше) повідомляли\,.*", re.M)
    ],
    'https://www.liga.net': [
        (r"^Читайте нас в Telegram:.*?$", re.M),
        (r"Еще по теме.*", re.S),
        (r"Ще по темі.*", re.S),
        (r"^Читайте также.*\n", re.M),
        (r"Присоединяйтесь к Instagram Liga.*", re.S),
        (r"^Підписуйтесь на.*$", re.M),
        (r"Подписывайтесь на LIGA.*", re.M|re.I)
    ],
    'espreso.tv':[
        (r"Слідкуйте за подіями в Україні та світі.*", re.S),
        (r"Все по темі.*", re.S),
        (r"Підписуйтесь на Telegram.*", re.S),
        (r"Стежте за найважливішими новинами Львова.*", re.M)
#         (r"(^[\* ]*.*\n)+", re.M)
    ],
    'strana.ua': [
        (r"^Читайте также ?\n( ?\*.*?\n)+", re.M),
        (r"Подпишитесь на телеграм\-канал.*", re.S),
        (r"Читайте Страну в Google News.*", re.S),
        (r'Ранее \"Страна\" сообщала\,.*', re.M)
        
    ],
    'tsn.ua': [
        (r"^\* Facebook.*\* Відправити лист", re.S|re.M),
        (r"^\* WhatsApp.*\* Відправити лист", re.S|re.M),
        (r"\* Відправити лист", re.S),
        (r"\* Повноекранний режим$", re.M),
        (r"[# ]*Читайте також: *\n.*\n", re.M),
        (r"Приєднуйтесь також до tsn\.ua у Google News.*", re.S),
        (r"^ ?\* ?(Facebook|Twitter|Telegram|Messenger|Viber)$", re.M),
        (r"^ ?\* ?WhatsApp$", re.M),
        (r"^Раніше повідомлялося.*", re.M),
        (r"Стежте за останніми новинами ТСН.*", re.M|re.I),
        (r"^[\# ]*Новини тижня:.*", re.M)
    ],
    'https://hromadske.radio': [
        (r"Підписуйтесь на Telegram-канал.*", re.S)
    ],
    'znaj.ua': [
        (r"Обов'язково підпишись.*", re.S),
        (r"Популярні новини зараз.*Показати ще", re.S),
        (r"Популярні новини.*", re.S),
        (r"Підпишіться на Знай.*", re.M),
        (r"^Дивіться:.*", re.M),
        (r"Читайте Знай в Google News!\n", re.M),
        (r"((Як( раніше)? (повідомля.|писав)( портал)? (.*?)Знай)|(Також.? (.*?)Знай.{,5} (писав|повідомл))|(Раніше ми (повідомляли|писали))).*", re.S),
        (r"Підпишись на наш Viber.*", re.M),
        (r"(Раніше|Нещодавно)( портал)? .?Знай\.ua.*", re.S),
        (r"^[\>\#\* ]*Нагадаємо,.*", re.M),
        (r"^Також для Знай\.ua.*", re.M),
        (r"^Знай\.ua писав.*", re.M),
        (r"^Нагадавши,.*", re.M)

    ],
    'fakty.com.ua': [
        (r"^Читайте:.*?$", re.M),
        (r"^Читайте\n.*\n", re.M)
    ],
    'https://www.epravda.com.ua': [
        (r"Читайте детальніше:.*", re.S),
        (r"Читайте нас у Telegram.*", re.S),
        (r"Приєднуйтесь до нашого каналу на YouTube.*", re.S),
        (r"^(Нагад(у|а)ємо|Передісторія):.*", re.S|re.M),
        (r"^Що було раніше\:.*", re.S|re.M),
        (r"Довідково:.*", re.M),
        (r"Читайте нас також у Telegram.*", re.S),
        (r"Матеріали за темою.*", re.S)
        
    ],
    'https://www.pravda.com.ua': [
        (r"Читайте детальніше:.*", re.S),
        (r"Читайте нас у Telegram.*", re.S),
        (r"^Українська правда$", re.M),
        (r"Приєднуйтесь до нашого каналу на YouTube.*", re.S),
        (r"^(Нагад(у|а)ємо|Передісторія): *\n(^ *\*.*\n)+", re.M),
        (r"^Що було раніше\:.*", re.S|re.M),
        (r"Довідково:.*", re.M),
        (r"^\d+\n", re.M)
        
    ],
    'https://ukr.lb.ua': [
        (r"Читайте головні новини LB\.ua.*", re.S),
        (r"^(Facebook|Twitter)$", re.M),
        (r"^Темы:.*", re.S|re.M)
    ],
    'https://ukranews.com': [
        (r"Больше новостей о:.*", re.S),
        (r"Коментарии Facebook.*", re.S),
        (r"^\* \d+\n \* \d+\n", re.S|re.M),
        (r"^Українськ. Новини\nУкраїнськ. Новини\n.*\n\#.*\n.*\n", re.M),
        (r"^Українськ. Новини\n.*\n\#.*\n.*\n", re.M),
        (r"Читайте также:.*$", re.M),
        (r"^Как сообщали Українськ. Новини.*", re.M),
        (r"Добавьте ukranews\.com.*", re.S),
        (r"Подпишитесь на (рассылку|авторский).*", re.S) 
    ],
   
    'zik.ua': [
        (r"^Новини за темою:.*?$", re.M),
        (r"^(Як|Раніше) повідомляли\,.*", re.M)

    ],
    'https://ua.korrespondent.net/': [
        (r"(Новини|Новости) (від|от) Корреспондент.*", re.S),
        (r"(Підписуйтесь|Подписывайтесь) на наш канал.*", re.S),
        (r"^Напередодні повідомлялося\,.*", re.M)
       
    ],
    'vgolos.com.ua': [
        (r"###? Як писав \“Вголос\”:.*", re.S),
        (r"^Всі свіжі новини на нашому.*", re.M),
        (r"[\# ]+Читайте більше.*", re.S),
        (r"[\# ]*Нагадаємо: ?\n.*", re.S),
        (r"Як писав «Вголос»,.*", re.S),
        (r"We blocked Facebook.*", re.M),
        (r"Как сообщалось ранее,.*", re.M),
        (r"Напомним также,.*", re.M),
        (r"Ранее сообщалось,.*", re.M)
    ],
    'glavcom.ua': [
        (r"## Хроника событий.*", re.S),
        (r"Опитування$", re.M),
        (r"Читайте также:.*$", re.M),
        (r"Читайте також[: ]+\n?([\* ]+.*\n?){1,}", re.M),
        (r"^на весь екран згорнути$", re.M),
        (r"Всі фоторепоратажі\n(.*\n){4}", re.M),
        (r"Думки авторів рубрики «Думки вголос».*", re.S),
        (r"^До слова,.*", re.M),
        (r"^К слову,.*", re.M),
        (r" \* .*", re.M),
        (r"Ранее «Скотч» сообщал,.*", re.S),
        (r"Раніше стало відомо.*", re.M)
    ],
    '24tv.ua': [
        (r"Читайте тако?же?:?.*$", re.M),
        (r"^Поділитися новиною ?$", re.M),
        (r"^ ?\* \* \* \* \* ?$", re.M),
        (r"^[# ]*Що було раніше[ \:]*\n(^ *\*.*\n)+", re.M)
    ], 
    'nv.ua': [
        (r"^Хроники коронавируса.*Отправляем ежедневно в 08:00", re.S|re.M),
        (r"^Читайте также:\n\n.*\n", re.M),
        (r"НВ обладает эксклюзивным правом на перевод и публикацию колонок Project Syndicate.*", re.S),
        (r"Присоединяйтесь к нашему телеграм.*", re.S),
        (r"Подписаться на ежедневную email.*", re.S)
    ],
    'suspilne.media': [
        (r"^[# ]*Що відомо.*", re.S),
        (r"^[# ]*## Читайте також.*", re.S),
        (r"(> )?Читайте також:.*", re.M),
        (r"Читайте нас у Telegram.*", re.M)
    ],
    'babel.ua': [
        (r"(^ \* .*$){1,}$", re.M)
    ],
    'bykvu.com': [
        (r"(^ *\* *.*$){1,}$", re.M)
    ],
    'golos.ua': [
        (r"^Как сообщалось ранее.*", re.M),
        (r"Напомним также,.*", re.M)
    ],
    'vesti.ua': [
        (r"Подпишитесь на ежедневную.*", re.S),
        (r"^Как сообщалось ранее.*", re.M),
        (r"[# ]*Другие новости.*", re.S),
        (r"[# ]*Ранее Vesti\.ua сообщали.*", re.S)
        
    ],
    'fakty.ua': [
        (r"Читайте нас (в|у) Telegram*", re.S),
        (r"Сделайте \"ФАКТЫ\".*", re.S),
        (r"Зробіть «ФАКТИ».*", re.S),
        (r"Раніше, як писали «ФАКТИ».*", re.M)
    ],
    'zaxid.net': [
        (r"Читайте нас (в|у) Telegram*", re.M),
        (r"^Раніше, нагадаємо.*", re.M),
        (r"До слова,.*", re.M),
        (r"Тепер ми в Instagram.*", re.M),
        (r"Це наш Instagram, \n?в нього ми вкладаємо душу.*", re.M),
        (r"Як( раніше)? (писав|інформував|повідомляв) ZAXID\.NET.*", re.M|re.I)
    ],
    'kp.ua': [
        (r"[# ]*(ЧИТАЙТЕ|ЧИАТЙТЕ) ТАКЖЕ.*", re.S)
    ],
    'telegraf.com.ua': [
        (r"Раніше \"?Телеграф\"? писав.*", re.M),
        (r"Как сообщал \"Телеграф\".*", re.M),
        (r"\"Телеграф\" напоминает.*", re.M)
    ],
    'today.ua': [
        (r"^[# ]*Популярні зараз *\n([\* ]+.*\n)+", re.M),
        (r"^Раніше повідомлялося.*", re.M)
    ],
    'gordonua.com': [
        (r"Контекст: ?\n.*", re.S)
    ],
    # this shoud be the last part
    # patterns to finally strip in all news 
    # it is expected that every domain contains a dot
    '.': [
        (r"^[#\* ]*Читайте тако?же? *:? *\n?.*$", re.M | re.I),
        (r"^[#\* ]*Тако?же? читайте *:? *\n?.*$", re.M | re.I),
        (r"^[#\* ]*(Нагад(а|у)ємо|Напомним)\,.*", re.M),
        (r"^((Ранее мы сообщали)|(Также сообщалось)|(Раніше повідомляли))\,.*", re.M),
        (r"Раніше ми розповідали\,.*", re.M),
        (r"^[\-\*#\| ]+\n", re.M),
        (r"Читайте також( статтю)?: ?\n?.*\n?", re.M | re.I),
        (r"^[#\*> ]*Нагадаємо\,.*", re.M),
        (r"^[#\*> ]*Також нагадаємо.*", re.M)
    ]

}

pub_type_patterns = {
    'in_category': {
        'https://ukranews.com': [
            ('мнение', 'blog')
        ],
        'www.radiosvoboda.org': [
            ('новини', 'news')
        ],
        'espreso.tv': [
            ('блог', 'blog')
        ],
        'glavcom.ua': [
            ('Статьи', 'publication')
        ],
        'suspilne.media': [
            ('Пояснюємо', 'publication')
        ],
        'zaxid.net': [
            ('Статті', 'publication'),
            ('Блоги', 'blog')
        ],
        'fakty.ua': [
            ('(Клуб споживачів)|(Запитайте у «ФАКТІВ»)|Інтерв\'ю|(Життєві історії)|(Пряма лінія)|(Історія сучасності)', 'publication'),
            ('Блоги', 'blog')
        ],
        'kp.ua': [
            ('История', 'publication')
        ]
    },
    'in_tags': {
        'vesti.ua': [
            ('разборы|(Ежу Понятно)', 'publication')
        ],
        'kp.ua': [
            ('Актуальное интервью', 'publication'),
            ('Кинопремьеры', 'publication')
        ]

    },
    'in_text': {
        'www.radiosvoboda.org': [
            ('Рубрика «Точка зору»', 'blog')
            ]
    }
}
